# 튜플 기초

# ===========================================================
#  튜플 (tuple): 여러 객체를 순서가 있는 컬렉션으로 묶어 저장하는 변경 불가능한 자료형
#  튜플의 특징
#  1. (immutable, 변경 불가능 ) -> 리스트와의 차이점
#  2. (iterable, 반복 가능)
#  3. (sequence 자료형 - 인덱싱, 슬라이싱 가능)
#  4. (중복을 허용)
# ===========================================================

# 튜플 생성
t1 = ()
t2 = (1, 2, 3)
t3 = 1, 2, 3 
t4 = (1,)

t = (1,3.14, "Hello", [1, 2, 3], (4, 5, 6))


print(t1)               # ()
print(t2)               # (1, 2, 3)
print(type(t))
# ===========================================================
# 1. 튜플은 immutable하다. (변경 불가능)
# ===========================================================
# t1[0] = 100  # TypeError 발생 (요소 수정 불가)
# del t1[0]    # TypeError 발생 (요소 삭제 불가)


# ===========================================================
# 2. 튜플은 iterable하다. (반복 가능)
# ===========================================================

t = (10, 20, 30, 40)

# 튜플 순회
for item in t:
    print(item)
for i, data in enumerate(t):
    print(i, data)

# ===========================================================
# 3. 튜플은 sequence 자료형이다. (인덱싱, 슬라이싱 가능)
# ===========================================================

# 인덱싱
print(t[0])              # 첫번째 요소 출력 (10)
print(t[-1])             # 마지막 요소 출력 (40)

# 슬라이싱
print(t[:2])             # 앞에서 2개 출력 (10, 20)
print(t[1:3])            # 중간 2개 출력 (20, 30)
print(t[::-1])           # 거꾸로 출력 (40, 30, 20, 10)


# ===========================================================
# 4. 튜플은 중복을 허용한다. (같은 값을 여러번 담을 수 있음)
# ===========================================================
dup_tuple = (1, 2, 2, 3, 3, 3)
print(dup_tuple)         # (1, 2, 2, 3, 3, 3)


# ===========================================================
#  파이썬 내장 함수
# ===========================================================

a = (3, 4, 1, 5, 2)

print(len(a))            # 길이 반환 (5)
print(max(a))            # 최댓값 반환 (5)
print(min(a))            # 최솟값 반환 (1)
print(sum(a))            # 합계 반환 (15)
print(sorted(a))         # 정렬된 리스트 반환 ([1, 2, 3, 4, 5])

# 튜플 합치기
b = (6, 7)
c = a + b
print(c)                 # (3, 4, 1, 5, 2, 6, 7)

# 튜플은 원본 불가이므로, 원본을 바꾸는 extend, append 메소드가 없음

# 튜플 반복하기
d = b * 2
print(d)                 # (6, 7, 6, 7)

# 멤버십 연산자
print(3 in a)            # True
print(10 not in a)       # True